[
  {
    "company": "Productbox",
    "website": "https://www.productbox.dev",
    "position": "Senior Full stack engineer",
    "startDate": "2024-12-02",
    "endDate": null,
    "oneLine": "I joined Productbox again for an exciting project. I have been working on evaluating LLM models. Some of my experiences includes:",
    "bullets": [
      "Leading the evaluation of LLM models by designing and implementing robust test scripts that automate performance benchmarking and ensure alignment with client requirements.",
      "Designing and developing scalable testing frameworks using advanced scripting techniques to validate model accuracy, efficiency, and reliability in a highly confidential project.",
      "Experimenting with multiple strategies and configurations, including state-of-the-art prompt engineering, to maximize the performance and fault tolerance of LLM models.",
      "Collaborating with cross-functional teams—spanning data science, engineering, and product management—to drive continuous improvements and achieve optimal model performance.",
      "Leveraging a diverse technology stack and best practices to streamline automated testing, troubleshoot performance issues, and ensure seamless integration within secure and discreet project environments"
    ],
    "volunteer": false
  },
  {
    "company": "DPL",
    "website": "https://www.dplit.com",
    "position": "Software Engineer",
    "startDate": "2024-12-14",
    "endDate": "2024-12-31",
    "oneLine": "2 years at DPL, I contributed to multiple projects across front-end and back-end development while leveraging modern cloud technologies.",
    "bullets": [
      "Leading the development of an Applicant Tracking System (ATS) using React and Tailwind, ensuring a seamless and responsive user experience.",
      "Building scalable backend services with NestJS while maintaining high code quality using Jest.",
      "Designing and implementing microservices architecture to improve modularity and scalability.",
      "Deploying and managing containerized applications using Docker and AWS ECS, optimizing cloud performance.",
      "Maintaining secure and efficient Docker image management on AWS ECR.",
      "Implementing monitoring and debugging solutions with New Relic and Sentry for enhanced system reliability."
    ],
    "volunteer": false
  },
  {
    "company": "SFU Technologies",
    "website": "https://www.sfutech.com",
    "position": "Lead Software Engineer",
    "startDate": "2022-06-01",
    "endDate": "2022-12-01",
    "oneLine": "During my tenure at SFU Technologies, I played a key role in leading the development of enterprise-grade HRM and CRM systems. Some of my achievements include:",
    "bullets": [
      "Successfully leading cross-functional teams to design and develop scalable business applications.",
      "Architecting and developing systems using the MERN stack for seamless integration and performance.",
      "Writing and maintaining unit and integration tests using Mocha and Chai to ensure software reliability.",
      "Managing projects using Agile methodologies, ensuring smooth development cycles and timely delivery."
    ],
    "volunteer": false
  },
  {
    "company": "Productbox - I",
    "website": "https://www.productbox.dev",
    "position": "Associate Full-stack Developer",
    "startDate": "2019-08-15",
    "endDate": "2022-06-15",
    "oneLine": "Over my three-year journey at Productbox, I contributed to a variety of projects, working on both front-end and back-end technologies to modernize applications and enhance user experiences.",
    "bullets": [
      "Leading the development team in designing and implementing scalable and efficient backend systems, utilizing Node.js, Serverless Computing, and other technologies to build robust and fault-tolerant systems.",
      "Designing and developing scalable and efficient full-stack applications using Node.js, Serverless Framework, and other technologies, and implementing RESTful APIs, ensuring adherence to best practices and security protocols.",
      "Contributing to the development of multiple web applications, enhancing their robustness, fault tolerance, and scalability, using Node.js, React, Serverless, and AlpineJS to build user-friendly web applications and APIs for all platforms.",
      "Collaborating with cross-functional teams, including DevOps, UI/UX designers, QA, and clients, to ensure seamless project execution, and utilizing Agile methodologies to foster efficient communication and adaptation.",
      "Gaining experience in a range of technologies, including MySQL, Express.js, Firebase Authentication, Python's OpenCV, and React-Native, and utilizing Git for peer-programming, reviewing, and troubleshooting."
    ],
    "volunteer": false
  }
]